In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("salrlary prediction.csv")

In [3]:
df

  experience  test_score  inter score  Salary
0        NaN         8.0            9   50000
1        NaN         8.0            6   45000
2       five         6.0            7   60000
3        two        10.0           10   65000
4      seven         9.0            6   70000
5      three         7.0           10   62000
6        ten         NaN            7   72000
7     eleven         7.0            8   80000

In [4]:
df["experience"].replace(np.NaN,"0",inplace=True)

In [5]:
df["experience"]

0         0
1         0
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [6]:
df

  experience  test_score  inter score  Salary
0          0         8.0            9   50000
1          0         8.0            6   45000
2       five         6.0            7   60000
3        two        10.0           10   65000
4      seven         9.0            6   70000
5      three         7.0           10   62000
6        ten         NaN            7   72000
7     eleven         7.0            8   80000

In [7]:
median_data=df["test_score"].median()

In [8]:
df["test_score"].replace(np.nan,median_data,inplace=True)

In [9]:
df

  experience  test_score  inter score  Salary
0          0         8.0            9   50000
1          0         8.0            6   45000
2       five         6.0            7   60000
3        two        10.0           10   65000
4      seven         9.0            6   70000
5      three         7.0           10   62000
6        ten         8.0            7   72000
7     eleven         7.0            8   80000

## Now we can apply multilinear regression

In [10]:
from sklearn.model_selection import train_test_split

In [34]:
y=df[["Salary"]]
x=df[["test_score","inter score"]]

In [35]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.1)

In [36]:
x_train.head()

   test_score  inter score
0         8.0            9
7         7.0            8
1         8.0            6
5         7.0           10
6         8.0            7

In [37]:
x_test.head()

   test_score  inter score
4         9.0            6

In [38]:
from sklearn.linear_model import LinearRegression

In [39]:
lr=LinearRegression()

In [40]:
lr.fit(x_train,y_train)

LinearRegression()

In [41]:
lr.predict(x_test)

array([[55915.49295775]])